// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

int input_integer = 193;
Console.WriteLine((input_integer / 10) % 10);




